/**
 * Задание 3 . Из задания первого урока. Определить метод, производящий преобразование разработанного XML-документа в документ, указанный в каждом задании.
 * Константин Панченко, [17.05.2023 18:09]
 * Тоді думаю можна скіпнути, дивився виконання інших студентів,  вони також пропускали
 *
 */
package task3;

public class Main {
    public static void main(String[] args) {
        System.out.println("Skip");
    }
}
